# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Install ZSH and plugins/themes
# brew 'zsh' # don't need anymore comes with OSX

# Install Binaries
brew 'node'
brew 'nvm'
brew 'gh'
brew 'tree'
brew 'trash'
brew 'neovim'
brew 'fzf'
brew 'ripgrep'
brew 'bat'
brew 'jq'
brew 'lazygit'

# Shell prompt & navigation
brew 'starship'
brew 'zoxide'

# Language version managers
brew 'pyenv'

# Apps
cask 'ghostty'
cask 'claude-code'
cask 'warp'
# cask 'alfred'
# cask 'iterm2'
# cask 'visual-studio-code'
# cask 'slack'
# cask 'rectangle'
# cask 'docker'
# cask 'firefox'
# cask 'google-chrome'
