# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'macvim-dev/macvim'
# tap 'caskroom/versions'

# Install ZSH and plugins/themes
brew 'zsh'

# Install Binaries
brew 'awscli'
brew 'awsebcli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'node'
brew 'trash'
brew 'python'
brew 'macvim'
brew 'fzf'
brew 'the_silver_searcher'
# Development

# Apps
cask 'alfred'
cask 'iterm2'
cask 'visual-studio-code'
cask 'slack'
# cask 'spectacle' # No longer maintained, sadly
cask 'rectangle' # A Spectacle replacement
# cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'transmit'
cask 'vlc'
cask 'timing'

# Fonts
cask 'font-hack-nerd-font'
