# Taps
tap 'caskroom/cask'
# tap 'caskroom/fonts'
# tap 'caskroom/versions'

# Install ZSH
brew 'zsh'
# brew 'zsh-completions'
# brew 'zsh-autosuggestions'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'node'
brew 'trash'

# Development

# Apps
cask 'alfred'
cask 'iterm2'
cask 'visual-studio-code'
cask 'slack'
cask 'spectacle'
# cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'transmit'
cask 'vlc'

# Fonts
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
# cask 'font-fira-code'
# cask 'font-firacode-nerd-font-mono'
